web/application/files/fedex/wsdl/GlobalShipAddress/SearchLocationsRequest.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://fedex.com/ws/gsai/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:SearchLocationsRequest>
         <v1:WebAuthenticationDetail>
            <v1:UserCredential>
               <v1:Key>p7sPy4Sctm7XZ8gx</v1:Key>
               <v1:Password/>
            </v1:UserCredential>
         </v1:WebAuthenticationDetail>
         <v1:ClientDetail>
            <v1:AccountNumber></v1:AccountNumber>
            <v1:MeterNumber></v1:MeterNumber>
            <v1:Region>US</v1:Region>
         </v1:ClientDetail>
         <v1:Version>
            <v1:ServiceId>gsai</v1:ServiceId>
            <v1:Major>1</v1:Major>
            <v1:Intermediate>0</v1:Intermediate>
            <v1:Minor>0</v1:Minor>
         </v1:Version>
         <v1:EffectiveDate>2012-05-07</v1:EffectiveDate>
         <v1:LocationsSearchCriterion>ADDRESS</v1:LocationsSearchCriterion>
         <v1:Address>
            <v1:StreetLines>Street Line 1</v1:StreetLines>
            <v1:City>Memphis</v1:City>
            <v1:StateOrProvinceCode>TN</v1:StateOrProvinceCode>
            <v1:PostalCode>38118</v1:PostalCode>
            <v1:CountryCode>US</v1:CountryCode>
            <v1:Residential>0</v1:Residential>
         </v1:Address>
         <v1:PhoneNumber/>
         <v1:GeographicCoordinates/>
         <v1:MultipleMatchesAction>RETURN_ALL</v1:MultipleMatchesAction>
         <v1:SortDetail>
            <v1:Criterion>DISTANCE</v1:Criterion>
            <v1:Order>LOWEST_TO_HIGHEST</v1:Order>
         </v1:SortDetail>
         <v1:Constraints>
            <v1:RadiusDistance>
               <v1:Value>15.0</v1:Value>
               <v1:Units>KM</v1:Units>
            </v1:RadiusDistance>
            <v1:ExpressDropOffTimeNeeded>09:30:47-08:00</v1:ExpressDropOffTimeNeeded>
            <v1:ResultsFilters>EXCLUDE_LOCATIONS_OUTSIDE_STATE_OR_PROVINCE</v1:ResultsFilters>
            <v1:SupportedRedirectToHoldServices>FEDEX_EXPRESS</v1:SupportedRedirectToHoldServices>
            <v1:RequiredLocationAttributes>ACCEPTS_CASH</v1:RequiredLocationAttributes>
            <v1:ResultsToSkip>1</v1:ResultsToSkip>
            <v1:ResultsRequested>1</v1:ResultsRequested>
            <v1:LocationContentOptions>HOLIDAYS</v1:LocationContentOptions>
            <v1:LocationTypesToInclude>FEDEX_OFFICE</v1:LocationTypesToInclude>
         </v1:Constraints>
      </v1:SearchLocationsRequest>
   </soapenv:Body>
</soapenv:Envelope>